export const filingTypeMap = [
  {
    label: "เอกสารขอเปิดโครงการ",
    value: 0,
  },
  {
    label:
      "เอกสารขอใช้งานกายภาพ : ขอใช้สถานที่และอุปกรณ์ / ขอใช้อุปกรณ์ / ขอใช้ลานจอดรถ / ขอเปลี่ยนเส้นทางจารจร",
    value: 1,
  },
  {
    label: "เอกสารขอยืมสำรองจ่าย",
    value: 2,
  },
  {
    label: "เอกสารขอสปอนเซอร์",
    value: 3,
  },
  {
    label: "เอกสารขอบคุณสปอนเซอร์",
    value: 4,
  },
  {
    label:
      "เอกสารในโครงการ : จดหมายทั่วไปในคณะ / ทั่วไปนอกคณะ / เชิญวิทยากร / ขอบคุณวิทยากร",
    value: 5,
  },
  {
    label: "เอกสารรายงานผลการดำเนินงาน (สรุปกิจกรรม)",
    value: 6,
  },
  {
    label: "เอกสารขออนุมัติเบิกจ่าย (สรุปค่าใช้จ่าย)",
    value: 7,
  },
  {
    label: "เอกสารขอเบิกเงิน",
    value: 8,
  },
  {
    label: "เอกสารนอกโครงการ",
    value: 9,
  },
];

export const projectTypeMap = [
  {
    label: "โครงการฝ่ายกิจการภายใน",
    value: 10,
  },
  {
    label: "โครงการฝ่ายศิลปะและวัฒนธรรม",
    value: 11,
  },
  {
    label: "โครงการฝ่ายกีฬา",
    value: 12,
  },
  {
    label: "โครงการฝ่ายกิจการภายนอก",
    value: 20,
  },
  {
    label: "โครงการฝ่ายนิสิตสัมพันธ์",
    value: 30,
  },
  {
    label: "โครงการฝ่ายพัฒนาสังคมและบำเพ็ญประโยชน์",
    value: 40,
  },
  {
    label: "โครงการฝ่ายพัฒนาองค์กร",
    value: 50,
  },
  {
    label: "โครงการฝ่ายสนับสนุน",
    value: 60,
  },
  {
    label: "โครงการฝ่ายสื่อสารองค์กร",
    value: 70,
  },
  {
    label: "โครงการอื่นๆของกวศ.",
    value: 80,
  },
  {
    label: "โครงการฝ่ายวิชาการ",
    value: 90,
  },
];
